In [1]:
import pandas as pd
print("the version of pandas is", pd.__version__)

people = {"first": ["Corey", "Jane", "John"],
          "last": ["Schafer", "Doe", "Doe"],
          "email": ["CoreySchafer@gmail.com", "JaneDoe@email.com", "JohnDoe@email.com"]
          }
df = pd.DataFrame(people)
df

the version of pandas is 2.2.2

   first     last                   email
0  Corey  Schafer  CoreySchafer@gmail.com
1   Jane      Doe       JaneDoe@email.com
2   John      Doe       JohnDoe@email.com

In [2]:
"""PART ONE: MODIFY THE COLUMNS' NAMES"""

"PART ONE: MODIFY THE COLUMNS' NAMES"

In [3]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [4]:
df.columns = ['first name', 'last name', 'email']
df

  first name last name                   email
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@email.com
2       John       Doe       JohnDoe@email.com

In [5]:
df.columns = [x.upper() for x in df.columns]
df

  FIRST NAME LAST NAME                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@email.com
2       John       Doe       JohnDoe@email.com

In [6]:
df.columns = df.columns.str.replace(' ', '_')
df

  FIRST_NAME LAST_NAME                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@email.com
2       John       Doe       JohnDoe@email.com

In [7]:
df.EMAIL

0    CoreySchafer@gmail.com
1         JaneDoe@email.com
2         JohnDoe@email.com
Name: EMAIL, dtype: object

In [8]:
df.rename(columns={'FIRST_NAME': 'first_name',
          'LAST_NAME': 'last_name'}, inplace=True)
df

  first_name last_name                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@email.com
2       John       Doe       JohnDoe@email.com

In [9]:
"""PART TWO: MODIFY THE ELEMENTS IN THE TABLE."""

'PART TWO: MODIFY THE ELEMENTS IN THE TABLE.'

In [10]:
# impossible when rows are multiple
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
df

  first_name last_name                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@email.com
2       John     Smith     JohnSmith@email.com

In [11]:
df.loc[2, 'last_name'] = 'Doe'
df

  first_name last_name                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@email.com
2       John       Doe     JohnSmith@email.com

In [12]:
# mush faster than df.loc and has no overhead
df.at[2, 'last_name'] = 'Smith'
df

  first_name last_name                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@email.com
2       John     Smith     JohnSmith@email.com

In [13]:
"""This operation will raise a warning and won't take effect because pandas doesn't allow modifications to a subset of a DataFrame.
A subset in pandas would return a copy rather than a view of the original DataFrame, meaning any changes made to the subset won't affect the original DataFrame.

filt = (df['last_name'] == 'Smith')
df[filt]['last_name'] = 'Doe'"""

"This operation will raise a warning and won't take effect because pandas doesn't allow modifications to a subset of a DataFrame.\nA subset in pandas would return a copy rather than a view of the original DataFrame, meaning any changes made to the subset won't affect the original DataFrame.\n\nfilt = (df['last_name'] == 'Smith')\ndf[filt]['last_name'] = 'Doe'"

In [14]:
filt = (df['last_name'] == 'Smith')
print(filt)
print(type(filt))
print(type(df[filt]))
print(type(df['last_name']))
df.loc[filt, 'last_name'] = 'Doe'
df

0    False
1    False
2     True
Name: last_name, dtype: bool
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

  first_name last_name                   EMAIL
0      Corey   Schafer  CoreySchafer@gmail.com
1       Jane       Doe       JaneDoe@email.com
2       John       Doe     JohnSmith@email.com

In [15]:
df['EMAIL'] = df['EMAIL'].str.lower()
df

  first_name last_name                   EMAIL
0      Corey   Schafer  coreyschafer@gmail.com
1       Jane       Doe       janedoe@email.com
2       John       Doe     johnsmith@email.com

In [16]:
print(df[['first_name', 'last_name']])
print(type(df[['first_name', 'last_name']]))

  first_name last_name
0      Corey   Schafer
1       Jane       Doe
2       John       Doe
<class 'pandas.core.frame.DataFrame'>

In [17]:
df['EMAIL'].apply(len)

0    22
1    17
2    19
Name: EMAIL, dtype: int64

In [18]:
df['EMAIL'] = df['EMAIL'].apply(lambda x: x.upper())
df

  first_name last_name                   EMAIL
0      Corey   Schafer  COREYSCHAFER@GMAIL.COM
1       Jane       Doe       JANEDOE@EMAIL.COM
2       John       Doe     JOHNSMITH@EMAIL.COM

In [19]:
df.apply(len)

first_name    3
last_name     3
EMAIL         3
dtype: int64

In [20]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [21]:
df.apply(min)

first_name                     Corey
last_name                        Doe
EMAIL         COREYSCHAFER@GMAIL.COM
dtype: object

In [22]:
df.apply(pd.Series.min)

first_name                     Corey
last_name                        Doe
EMAIL         COREYSCHAFER@GMAIL.COM
dtype: object

In [23]:
type(df.apply(pd.Series.min))

pandas.core.series.Series

In [24]:
df.map(len)

   first_name  last_name  EMAIL
0           5          7     22
1           4          3     17
2           4          3     19

In [25]:
df.map(lambda x: x.upper())

  first_name last_name                   EMAIL
0      COREY   SCHAFER  COREYSCHAFER@GMAIL.COM
1       JANE       DOE       JANEDOE@EMAIL.COM
2       JOHN       DOE     JOHNSMITH@EMAIL.COM

In [26]:
df.map(str.lower)

  first_name last_name                   EMAIL
0      corey   schafer  coreyschafer@gmail.com
1       jane       doe       janedoe@email.com
2       john       doe     johnsmith@email.com

In [27]:
df

  first_name last_name                   EMAIL
0      Corey   Schafer  COREYSCHAFER@GMAIL.COM
1       Jane       Doe       JANEDOE@EMAIL.COM
2       John       Doe     JOHNSMITH@EMAIL.COM

In [28]:
df['first_name'].map({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2      NaN
Name: first_name, dtype: object

In [29]:
df['first_name'].replace({'Corey': 'Chris', 'Jane': 'Mary'})

0    Chris
1     Mary
2     John
Name: first_name, dtype: object